var timeago = require('../../');

module.exports = function(t) {
  var tm = timeago('2016-06-20 12:30:00', 'be');
  tm.register('be', require('../../locales/be'));

  // test second
  t.equal(tm.format('2016-06-20 12:30:00'), 'толькі што');
  t.equal(tm.format('2016-06-20 12:29:50'), '10 секунд таму');
  t.equal(tm.format('2016-06-20 12:29:39'), '21 секунду таму');
  t.equal(tm.format('2016-06-20 12:29:38'), '22 секунды таму');
  t.equal(tm.format('2016-06-20 12:30:01'), 'праз некалькі секунд');
  t.equal(tm.format('2016-06-20 12:30:10'), 'праз 10 секунд');
  t.equal(tm.format('2016-06-20 12:30:21'), 'праз 21 секунду');
  t.equal(tm.format('2016-06-20 12:30:22'), 'праз 22 секунды');

  // test minute
  t.equal(tm.format('2016-06-20 12:29:00'), 'хвіліну таму');
  t.equal(tm.format('2016-06-20 12:28:00'), '2 хвіліны таму');
  t.equal(tm.format('2016-06-20 12:25:00'), '5 хвілін таму');
  t.equal(tm.format('2016-06-20 12:9:00'), '21 хвіліну таму');
  t.equal(tm.format('2016-06-20 12:31:00'), 'праз хвіліну');
  t.equal(tm.format('2016-06-20 12:32:00'), 'праз 2 хвіліны');
  t.equal(tm.format('2016-06-20 12:35:00'), 'праз 5 хвілін');
  t.equal(tm.format('2016-06-20 12:51:00'), 'праз 21 хвіліну');
  
  // test hour
  t.equal(tm.format('2016-06-20 11:30:00'), 'гадзіну таму');
  t.equal(tm.format('2016-06-20 10:30:00'), '2 гадзіны таму');
  t.equal(tm.format('2016-06-20 7:30:00'), '5 гадзін таму');
  t.equal(tm.format('2016-06-19 15:30:00'), '21 гадзіну таму');
  t.equal(tm.format('2016-06-20 13:30:00'), 'праз гадзіну');
  t.equal(tm.format('2016-06-20 14:30:00'), 'праз 2 гадзіны');
  t.equal(tm.format('2016-06-20 17:30:00'), 'праз 5 гадзін');
  t.equal(tm.format('2016-06-21 9:30:00'), 'праз 21 гадзіну');

  // test day
  t.equal(tm.format('2016-06-19 12:30:00'), 'дзень таму');
  t.equal(tm.format('2016-06-18 12:30:00'), '2 дні таму');
  t.equal(tm.format('2016-06-15 12:30:00'), '5 дзён таму');
  t.equal(tm.format('2016-06-21 12:30:00'), 'праз дзень');
  t.equal(tm.format('2016-06-22 12:30:00'), 'праз 2 дні');
  t.equal(tm.format('2016-06-25 12:30:00'), 'праз 5 дзён');

  // test week
  t.equal(tm.format('2016-06-13 12:30:00'), 'тыдзень таму');
  t.equal(tm.format('2016-06-06 12:30:00'), '2 тыдні таму');
  t.equal(tm.format('2016-06-27 12:30:00'), 'праз тыдзень');
  t.equal(tm.format('2016-07-04 12:30:00'), 'праз 2 тыдні');

  // test month
  t.equal(tm.format('2016-05-20 12:30:00'), 'месяц таму');
  t.equal(tm.format('2016-04-20 12:30:00'), '2 месяцы таму');
  t.equal(tm.format('2016-01-19 12:30:00'), '5 месяцаў таму');
  t.equal(tm.format('2016-07-21 12:30:00'), 'праз месяц');
  t.equal(tm.format('2016-08-20 12:30:00'), 'праз 2 месяцы');
  t.equal(tm.format('2016-11-20 12:30:00'), 'праз 5 месяцаў');

  // test year
  t.equal(tm.format('2015-06-20 12:30:00'), 'год таму');
  t.equal(tm.format('2014-06-20 12:30:00'), '2 гады таму');
  t.equal(tm.format('2011-06-20 12:30:00'), '5 гадоў таму');
  t.equal(tm.format('1995-06-20 12:30:00'), '21 год таму');
  t.equal(tm.format('2017-06-20 12:30:00'), 'праз год');
  t.equal(tm.format('2018-06-20 12:30:00'), 'праз 2 гады');
  t.equal(tm.format('2021-06-20 12:30:00'), 'праз 5 гадоў');
  t.equal(tm.format('2037-06-20 12:30:00'), 'праз 21 год');
};
