var timeago = require('../../')

module.exports = function(t) {
  var tm = timeago('2016-06-20 12:30:00', 'uk')
  tm.register('uk', require('../../locales/uk'))

  // test second
  t.equal(tm.format('2016-06-20 12:30:00'), 'щойно')
  t.equal(tm.format('2016-06-20 12:29:50'), '10 секунд тому')
  t.equal(tm.format('2016-06-20 12:29:39'), '21 секунду тому')
  t.equal(tm.format('2016-06-20 12:29:38'), '22 секунди тому')
  t.equal(tm.format('2016-06-20 12:30:30'), 'через 30 секунд')
  t.equal(tm.format('2016-06-20 12:30:05'), 'через декілька секунд')

  // // // test minute
  t.equal(tm.format('2016-06-20 12:29:00'), 'хвилину тому')
  t.equal(tm.format('2016-06-20 12:28:00'), '2 хвилини тому')
  t.equal(tm.format('2016-06-20 12:25:00'), '5 хвилин тому')
  t.equal(tm.format('2016-06-20 12:9:00'),  '21 хвилину тому')
  t.equal(tm.format('2016-06-20 12:31:00'), 'через хвилину')
  t.equal(tm.format('2016-06-20 12:32:00'), 'через 2 хвилини')
  t.equal(tm.format('2016-06-20 12:35:00'), 'через 5 хвилин')
  t.equal(tm.format('2016-06-20 12:51:00'), 'через 21 хвилину')

  // // // test hour
  t.equal(tm.format('2016-06-20 11:30:00'), 'годину тому')
  t.equal(tm.format('2016-06-20 10:30:00'), '2 години тому')
  t.equal(tm.format('2016-06-20 7:30:00'),  '5 годин тому')
  t.equal(tm.format('2016-06-19 15:30:00'), '21 годину тому')
  t.equal(tm.format('2016-06-20 13:30:00'), 'через годину')
  t.equal(tm.format('2016-06-20 14:30:00'), 'через 2 години')
  t.equal(tm.format('2016-06-20 17:30:00'), 'через 5 годин')
  t.equal(tm.format('2016-06-21 9:30:00'),  'через 21 годину')

  // // // test day
  t.equal(tm.format('2016-06-19 12:30:00'), 'день тому')
  t.equal(tm.format('2016-06-18 12:30:00'), '2 дні тому')
  t.equal(tm.format('2016-06-15 12:30:00'), '5 днів тому')
  t.equal(tm.format('2016-06-21 12:30:00'), 'через день')
  t.equal(tm.format('2016-06-22 12:30:00'), 'через 2 дні')
  t.equal(tm.format('2016-06-25 12:30:00'), 'через 5 днів')

  // // // test week
  t.equal(tm.format('2016-06-13 12:30:00'), 'тиждень тому')
  t.equal(tm.format('2016-06-06 12:30:00'), '2 тиждні тому')
  t.equal(tm.format('2016-06-27 12:30:00'), 'через тиждень')
  t.equal(tm.format('2016-07-04 12:30:00'), 'через 2 тиждні')

  // // // test month
  t.equal(tm.format('2016-05-20 12:30:00'), 'місяць тому')
  t.equal(tm.format('2016-04-20 12:30:00'), '2 місяці тому')
  t.equal(tm.format('2016-01-19 12:30:00'), '5 місяців тому')
  t.equal(tm.format('2016-07-21 12:30:00'), 'через місяць')
  t.equal(tm.format('2016-08-20 12:30:00'), 'через 2 місяці')
  t.equal(tm.format('2016-11-20 12:30:00'), 'через 5 місяців')

  // // // test year
  t.equal(tm.format('2015-06-20 12:30:00'), 'рік тому')
  t.equal(tm.format('2014-06-20 12:30:00'), '2 роки тому')
  t.equal(tm.format('2011-06-20 12:30:00'), '5 років тому')
  t.equal(tm.format('1995-06-20 12:30:00'), '21 рік тому')
  t.equal(tm.format('2017-06-20 12:30:00'), 'через рік')
  t.equal(tm.format('2018-06-20 12:30:00'), 'через 2 роки')
  t.equal(tm.format('2021-06-20 12:30:00'), 'через 5 років')
  t.equal(tm.format('2037-06-20 12:30:00'), 'через 21 рік')
}
