module.exports = function(number, index) {
  return [
    ['இப்போது', 'சற்று நேரம் முன்பு'],
    ['%s நொடிக்கு முன்', '%s நொடிகளில் '],
    ['1 நிமிடத்திற்க்கு முன்', ' 1 நிமிடத்தில்'],
    ['%s நிமிடத்திற்க்கு முன்', 'in %s நிமிடங்களில்'],
    ['1 மணி நேரத்திற்கு முன்', 'in 1 hour'],
    ['%s மணி நேரத்திற்கு முன்', 'in %s hours'],
    ['1 நாளுக்கு முன்', 'in 1 day'],
    ['%s நாட்களுக்கு முன்', 'in %s days'],
    ['1 வாரத்திற்கு முன்', 'in 1 week'],
    ['%s வாரங்களுக்கு முன்', 'in %s weeks'],
    ['1 மாதத்திற்கு முன்', 'in 1 month'],
    ['%s மாதங்களுக்கு முன்', 'in %s months'],
    ['1 வருடத்திற்கு முன்', 'in 1 year'],
    ['%s வருடங்களுக்கு முன்', 'in %s years']
  ][index];
}