'use strict';

Object.defineProperty(exports, "__esModule", {
  value: true
});

exports.default = function (number, index) {
  return [['همین الآن', 'لحظاتی پیش'], ['%s ثانیه پیش', 'حدود %s ثانیه پیش'], ['1 دقیقه پیش', 'حدود 1 دقیقه پیش'], ['%s دقیقه پیش', 'حدود %s دقیقه پیش'], ['1 ساعت پیش', 'حدود 1 ساعت پیش'], ['%s ساعت پیش', 'حدود %s ساعت پیش'], ['1 روز پیش', 'حدود 1 روز پیش'], ['%s روز پیش', 'حدود %s روز پیش'], ['1 هفته پیش', 'حدود 1 هفته پیش'], ['%s هفته پیش', 'حدود %s هفته پیش'], ['1 ماه پیش', 'حدود 1 ماه پیش'], ['%s ماه پیش', 'حدود %s ماه پیش'], ['1 سال پیش', 'حدود 1 سال پیش'], ['%s سال پیش', 'حدود %s سال پیش']][index];
};

module.exports = exports['default'];