export default function(number, index) {
  return [
    ['همین الآن', 'لحظاتی پیش'],
    ['%s ثانیه پیش', 'حدود %s ثانیه پیش'],
    ['۱ دقیقه پیش', 'حدود ۱ دقیقه پیش'],
    ['%s دقیقه پیش', 'حدود %s دقیقه پیش'],
    ['۱ ساعت پیش', 'حدود ۱ ساعت پیش'],
    ['%s ساعت پیش', 'حدود %s ساعت پیش'],
    ['۱ روز پیش', 'حدود ۱ روز پیش'],
    ['%s روز پیش', 'حدود %s روز پیش'],
    ['۱ هفته پیش', 'حدود ۱ هفته پیش'],
    ['%s هفته پیش', 'حدود %s هفته پیش'],
    ['۱ ماه پیش', 'حدود ۱ ماه پیش'],
    ['%s ماه پیش', 'حدود %s ماه پیش'],
    ['۱ سال پیش', 'حدود ۱ سال پیش'],
    ['%s سال پیش', 'حدود %s سال پیش']
  ][index];
}
