// Nepali (Nepal)
export default function(number: number, index: number): [string, string] {
  return [
    ['अहिले', 'केहि समय'],
    ['%s सेकेन्ड अघि', '%s सेकेन्डमा'],
    ['1 मिनेट अघि', '1 मिनेटमा'],
    ['%s मिनेट अघि', '%s मिनेटमा'],
    ['1 घण्टा अघि', '1 घण्टामा'],
    ['%s घण्टा अघि', '%s घण्टामा'],
    ['1 दिन अघि', '1 दिनमा'],
    ['%s दिन अघि', '%s दिनमा'],
    ['1 हप्ता अघि', '1 हप्तामा'],
    ['%s हप्ता अघि', '%s हप्तामा'],
    ['1 महिना अघि', '1 महिनामा'],
    ['%s महिना अघि', '%s महिनामा'],
    ['1 वर्ष अघि', '1 वर्षमा'],
    ['%s वर्ष अघि', '%s वर्षमा'],
  ][index] as [string, string];
}
